In [2]:
import numpy as np
import pandas as pd
import seaborn as sns

In [6]:
data = pd.read_csv("daily-total-female-births.csv", header = 0)

Loading 5 records

In [7]:
data.head(5)

         Date  Births
0  1959-01-01      35
1  1959-01-02      32
2  1959-01-03      30
3  1959-01-04      31
4  1959-01-05      44

DATA TYPE

In [10]:
data['Date'].dtype   #this showss that date is used as a string hence we need to convert it to date type so...

dtype('O')

LOADING DATA WITH PARSE_DATES

In [11]:
df = pd.read_csv("daily-total-female-births.csv", header = 0, parse_dates = [0])

In [12]:
df.head(5)

        Date  Births
0 1959-01-01      35
1 1959-01-02      32
2 1959-01-03      30
3 1959-01-04      31
4 1959-01-05      44

In [13]:
df['Date'].dtype

dtype('<M8[ns]')

LOADING DATA AS SERIES

In [14]:
series = pd.read_csv("daily-total-female-births.csv", header = 0, parse_dates = [0], index_col = 0 , squeeze = True)

In [16]:
series.head()

Date
1959-01-01    35
1959-01-02    32
1959-01-03    30
1959-01-04    31
1959-01-05    44
Name: Births, dtype: int64

## EXPLORING TIME SERIES DATA

SIZE

In [18]:
series.shape

(365,)

In [19]:
df.shape

(365, 2)

QUERYING BY TIME

In [21]:
print(series['1959-01']) #all the values from day 1 to day 31 for month jan

Date
1959-01-01    35
1959-01-02    32
1959-01-03    30
1959-01-04    31
1959-01-05    44
1959-01-06    29
1959-01-07    45
1959-01-08    43
1959-01-09    38
1959-01-10    27
1959-01-11    38
1959-01-12    33
1959-01-13    55
1959-01-14    47
1959-01-15    45
1959-01-16    37
1959-01-17    50
1959-01-18    43
1959-01-19    41
1959-01-20    52
1959-01-21    34
1959-01-22    53
1959-01-23    39
1959-01-24    32
1959-01-25    37
1959-01-26    43
1959-01-27    39
1959-01-28    35
1959-01-29    44
1959-01-30    38
1959-01-31    24
Name: Births, dtype: int64

In [22]:
df[(df['Date'] > '1959-01-01') & (df['Date'] <= '1959- 02-01')]

         Date  Births
1  1959-01-02      32
2  1959-01-03      30
3  1959-01-04      31
4  1959-01-05      44
5  1959-01-06      29
6  1959-01-07      45
7  1959-01-08      43
8  1959-01-09      38
9  1959-01-10      27
10 1959-01-11      38
11 1959-01-12      33
12 1959-01-13      55
13 1959-01-14      47
14 1959-01-15      45
15 1959-01-16      37
16 1959-01-17      50
17 1959-01-18      43
18 1959-01-19      41
19 1959-01-20      52
20 1959-01-21      34
21 1959-01-22      53
22 1959-01-23      39
23 1959-01-24      32
24 1959-01-25      37
25 1959-01-26      43
26 1959-01-27      39
27 1959-01-28      35
28 1959-01-29      44
29 1959-01-30      38
30 1959-01-31      24

DESCRIPTIVE SERIES

In [23]:
series.describe()

count    365.000000
mean      41.980822
std        7.348257
min       23.000000
25%       37.000000
50%       42.000000
75%       46.000000
max       73.000000
Name: Births, dtype: float64

In [24]:
df.describe()

           Births
count  365.000000
mean    41.980822
std      7.348257
min     23.000000
25%     37.000000
50%     42.000000
75%     46.000000
max     73.000000